{
  "language": {
    "es": "Español",
    "en": "Inglés"
  },
  "navbar": {
    "home": "Inicio",
    "about": "Sobre mí",
    "experience": "Experiencia",
    "projects": "Proyectos",
    "skills": "Habilidades",
    "contact": "Contacto"
  },
  "header":{
    "career": "Ingeniero de Sistemas y",
    "post": "Desarrollador Web",
    "description": "+4 años de experiencia. <span class='text-color-blue'>Ingeniero de Sistemas y Desarrollador Web</span> de Cartagena, Colombia. Especializado en la experiencia de usuario.",
    "cv": "Ver mi CV",
    "available": "Disponible para trabajar"
  },
  "experience": {
    "title": "Experiencia",
    "zabud":{
      "position": "Desarrollador Full-Stack • ",
      "company": "Zabud Technologies",
      "date": "Dic 2019 - Oct 2024",
      "description": {
        "1": "Desarrollé microservicios en <strong class='text-color-blue'>Java</strong> con <strong class='text-color-blue'>Spring Boot</strong>, aplicando arquitectura hexagonal y manteniendo una cobertura de <strong class='text-color-blue'>pruebas superior al 80%</strong> mediante JUnit y Mockito.",
        "2": "Optimizé <strong class='text-color-blue'>interfaces web</strong> con frameworks como <strong class='text-color-blue'>Angular</strong> y <strong class='text-color-blue'>Vue.js</strong>, enfocándome en mejorar la experiencia de usuario e implementando el consumo de microservicios mediante <strong class='text-color-blue'>inyección de dependencias</strong> como patrón de diseño.",
        "3": "Colaboré en equipos ágiles bajo la metodología <strong class='text-color-blue'>SCRUM</strong>, participando activamente en reuniones diarias, planificaciones y revisiones de sprint.",
        "4": "Capacité a nuevos desarrolladores, facilitando su <strong class='text-color-blue'>integración técnica</strong> y adaptación al entorno de trabajo y tecnologías del proyecto."
      }
    }
  },
  "about":{
    "title": "Sobre Mí",
    "personal": {
      "title": "¿Quien Soy?",
      "description": "Soy Luis Alberto Gómez Arteaga, Ingeniero de Sistemas egresado de la Fundación Universitaria Tecnológico Comfenalco de Cartagena, Colombia.<br><br>Me apasiona desarrollar soluciones tecnológicas eficientes, aplicando buenas prácticas de programación y manteniendo siempre un enfoque centrado en el usuario."
    },
    "perfil": {
      "title": "Mi Perfil",
      "description": "Desarrollador Full-Stack con +4 años de experiencia en el desarrollo de aplicaciones web.<br><br>Especializado en frontend con JavaScript, TypeScript y Angular, con conocimientos básicos en Vue.js. Diseño interfaces responsivas y accesibles.<br><br>Experiencia en backend con Java y Spring Boot, enfocado en APIs REST y microservicios. Aplico principios SOLID y arquitecturas en capas y hexagonal. Manejo bases de datos relacionales como MySQL."
    },
    "objective": {
      "title": "Mi Objetivo",
      "description": "Mi objetivo es seguir expandiendo mis conocimientos en nuevas tecnologías, fortalecer los que ya he adquirido y continuar ganando experiencia como desarrollador tanto en el backend como en el frontend."
    }
  },
  "projects": {
    "title": "Proyectos",
    "items": [
      {
        "name": "Aldea - Zabud",
        "description": "Software de planificación estratégica empresarial diseñado para centralizar la definición, seguimiento y análisis de objetivos organizacionales. Responsable del desarrollo frontend con Angular, enfocado en la integración de microservicios, arquitectura modular basada en componentes y diseño de interfaces centradas en la experiencia de usuario."
      },
      {
        "name": "Microservicio SB",
        "description": "API de gestión de productos y facturación desarrollada con Java y Spring Boot, basada en arquitectura hexagonal. Expone operaciones CRUD completas para productos y facturas, con una estructura modular, desacoplada y escalable."
      },
      {
        "name": "Agenda de Personas",
        "description": "Aplicación Full Stack desarrollada durante mi formación inicial. Implementa operaciones CRUD sobre un listado de personas, con backend en Spring Boot y frontend en Angular, utilizando Bootstrap para diseño responsivo."
      }
    ]
  },
  "skills": {
    "title": "Habilidades Técnicas"
  },
  "contact": {
    "title": "Contacto",
    "info": "Si te interesa mi perfil, puedes contactarme a través de los siguientes enlaces o enviarme un correo usando el formulario a continuación.",
    "form": {
      "name": {
        "text": "Nombre",
        "valid": "El nombre es requerido."
      },
      "email": {
        "text": "Correo",
        "valid": "El correo es requerido."
      },
      "subject": {
        "text": "Asunto",
        "valid": "El asunto es requerido."
      },
      "messagge": {
        "text": "Mensaje",
        "valid": "El mensaje es requerido."
      }
    }
  }
}