{
  "navbar": {
    "home": "Inicio",
    "about": "Sobre mí",
    "experience": "Experiencia",
    "projects": "Proyectos",
    "skills": "Habilidades",
    "contact": "Contacto"
  },
  "header":{
    "career": "Ingeniero de Sistemas y",
    "post": "Desarrollador Web",
    "description": "Soluciones completas, de principio a fin.",
    "cv": "Ver mi CV",
    "available": "Disponible para trabajar"
  },
  "experience": {
    "title": "Experiencia",
    "zabud":{
      "position": "Desarrollador Full-Stack • ",
      "company": "Zabud Technologies",
      "date": "Dic 2019 - Oct 2024",
      "description": {
        "1": "Desarrollé y mantuve APIs RESTful utilizando Java con Spring Boot en diferentes entidades, aplicando arquitectura hexagonal, pruebas unitariascon JUnit y Mockito.",
        "2": "Implementé interfaces de usuario modernas y responsivas utilizando frameworks como Angular y Vue.js, enfocadas en la experiencia del usuario y compatibilidad multiplataforma.",
        "3": "Consumí servicios API REST en proyectos Angular e implementé validaciones de formularios reactivos.",
        "4": "Colaboré en equipos ágiles siguiendo SCRUM; participé en reuniones diarias y revisiones de sprint."
      }
    }
  },
  "about":{
    "title": "Sobre Mí",
    "personal": {
      "title": "¿Quien Soy?",
      "description": "Soy Luis Alberto Gómez Arteaga, Ingeniero de Sistemas egresado de la Fundación Universitaria Tecnológico Comfenalco de Cartagena, Colombia.<br><br>Me apasiona desarrollar soluciones tecnológicas eficientes, aplicando buenas prácticas de programación y manteniendo siempre un enfoque centrado en el usuario."
    },
    "perfil": {
      "title": "Mi Perfil",
      "description": "Desarrollador Full-Stack con 5 años de experiencia en el desarrollo de aplicaciones web.<br><br>Especializado en frontend con JavaScript, TypeScript y Angular, con conocimientos básicos en Vue.js. Diseño interfaces responsivas y accesibles.<br><br>Experiencia en backend con Java y Spring Boot, enfocado en APIs REST y microservicios. Aplico principios SOLID y arquitecturas en capas y hexagonal. Manejo bases de datos relacionales como MySQL."
    },
    "objective": {
      "title": "Mi Objetivo",
      "description": "Mi objetivo es seguir expandiendo mis conocimientos en nuevas tecnologías, fortalecer los que ya he adquirido y continuar ganando experiencia como desarrollador tanto en el backend como en el frontend."
    }
  },
  "projects": {
    "title": "Proyectos",
    "items": [
      {
        "name": "Aldea - Zabud",
        "description": "Software de planificación estratégica empresarial diseñado para centralizar la definición, seguimiento y análisis de objetivos organizacionales. Responsable del desarrollo frontend con Angular, enfocado en la integración de APIs RESTful, arquitectura modular basada en componentes y diseño de interfaces centradas en la experiencia de usuario."
      },
      {
        "name": "CRUD Producto y Factura",
        "description": "API de gestión de productos y facturación desarrollada con Java y Spring Boot, basada en arquitectura hexagonal. Expone operaciones CRUD completas para productos y facturas, con una estructura modular, desacoplada y escalable."
      },
      {
        "name": "Página Web Personal",
        "description": "Página web responsiva diseñada para presentar mi perfil profesional, conocimientos en desarrollo web y experiencia con diversas tecnologías. Funciona como portafolio personal, destacando proyectos, habilidades y trayectoria como desarrollador Full Stack."
      },
      {
        "name": "Agenda de Personas",
        "description": "Aplicación Full Stack desarrollada durante mi formación inicial. Implementa operaciones CRUD sobre un listado de personas, con backend en Spring Boot y frontend en Angular, utilizando Bootstrap para diseño responsivo."
      }
    ]
  },
  "skills": {
    "title": "Habilidades Técnicas"
  },
  "contact": {
    "title": "Contacto",
    "info": "Si te interesa mi perfil, puedes contactarme a través de los siguientes enlaces o enviarme un correo usando el formulario a continuación.",
    "form": {
      "name": {
        "text": "Nombre",
        "valid": "El nombre es requerido."
      },
      "email": {
        "text": "Correo",
        "valid": "El correo es requerido."
      },
      "subject": {
        "text": "Asunto",
        "valid": "El asunto es requerido."
      },
      "messagge": {
        "text": "Mensaje",
        "valid": "El mensaje es requerido."
      }
    }
  }
}